## 蘋果新聞抓取

In [2]:
import requests
res = requests.get('https://tw.appledaily.com/new/realtime') 
#res.text

In [3]:
from bs4 import BeautifulSoup
soup = BeautifulSoup(res.text, 'html.parser')

In [8]:
newsary = [] 
for link in soup.select('.rtddt a'):
    title = link.select('h1')[0].text
    category = link.select('h2')[0].text
    dt = link.select('time')[0].text
    url = link['href']
    newsary.append({'title':title, 'category':category, 'dt':dt, 'url':url})

In [10]:
import pandas
df  = pandas.DataFrame(newsary)
df.head()

,category,dt,title,url
0,國際,09:26,德國前總統丟工作後 被踢爆赴中國撈金(6),https://tw.news.appledaily.com/international/r...
1,地產,09:26,大膽就中！ 創造自己的巴洛克風,https://tw.finance.appledaily.com/realtime/201...
2,體育,09:24,【西甲】半場輸2球驚險扳回 貝提斯主和赫...(2),https://tw.sports.appledaily.com/realtime/2017...
3,生活,09:21,誠徵油漆工刷鐵門 她的開價讓網友怒了(262),https://tw.news.appledaily.com/life/realtime/2...
4,體育,09:13,7人得分雙位數 公牛爆冷客場大勝魔術(150),https://tw.sports.appledaily.com/realtime/2017...

## 語音小秘書

In [76]:
! pip install PyAudio

Collecting PyAudio
  Downloading PyAudio-0.2.11-cp36-cp36m-win_amd64.whl (52kB)
Installing collected packages: PyAudio
Successfully installed PyAudio-0.2.11

In [77]:
! pip install SpeechRecognition

Collecting SpeechRecognition
  Downloading SpeechRecognition-3.7.1-py2.py3-none-any.whl (32.8MB)
Installing collected packages: SpeechRecognition
Successfully installed SpeechRecognition-3.7.1

In [90]:
import speech_recognition
r = speech_recognition.Recognizer()

with speech_recognition.Microphone() as source:
    r.adjust_for_ambient_noise(source)
    audio = r.listen(source)

r.recognize_google(audio, language='zh-TW')

TypeError: recognize_bing() missing 1 required positional argument: 'key'

In [ ]:
! pip install gTTS

In [13]:
! pip install pygame

Collecting pygame
  Downloading pygame-1.9.3-cp36-cp36m-win_amd64.whl (4.2MB)
Installing collected packages: pygame
Successfully installed pygame-1.9.3

In [11]:
from gtts import gTTS
tts = gTTS(text='大大安安幾歲您好', lang='zh')
tts.save("hello4.mp3")

In [ ]:
from pygame import mixer
mixer.init()
import tempfile
def speak(sentence):
    with tempfile.NamedTemporaryFile(delete=True) as fp:
        tts = gTTS(text=sentence, lang='zh')
        tts.save("{}.mp3".format(fp.name))
        mixer.music.load('{}.mp3'.format(fp.name))
        mixer.music.play()
speak('今天很開心看到大家')

In [18]:
?requests.get

In [91]:
import requests
from bs4 import BeautifulSoup
def searchWiki(term):
    term = term.replace('Google','')
    res = requests.get('https://zh.wikipedia.org/wiki/{}'.format(term), allow_redirects=True)
    soup = BeautifulSoup(res.text, 'html.parser')
    article = soup.select('#mw-content-text > div > p')[0].text
    return article.split('。')[0]

In [92]:
import speech_recognition

def getSpeech():
    r = speech_recognition.Recognizer()

    with speech_recognition.Microphone() as source:
        r.adjust_for_ambient_noise(source)
        audio = r.listen(source)

    return r.recognize_google(audio, language='zh-TW')
getSpeech()

'怎麼弄'

In [93]:
speak(searchWiki(getSpeech()))

## Numpy

In [32]:
a = [1,3,5,7,9]
a.pop()
print(a)
a.append(9)
print(a)

[1, 3, 5, 7]
[1, 3, 5, 7, 9]

In [33]:
a = [1,3,5,7,9]
b = [2,4,6,8,10]

In [38]:
ary = []
for i in range(0, len(a)):
    ary.append(a[i] * b[i])
ary

[2, 12, 30, 56, 90]

In [39]:
[a[i] * b[i] for i in range(0, len(a))]

[2, 12, 30, 56, 90]

In [41]:
for ele in zip(a,b):
    print(ele)

(1, 2)
(3, 4)
(5, 6)
(7, 8)
(9, 10)

In [42]:
for i,j in zip(a,b):
    print(i * j)

2
12
30
56
90

In [43]:
[i*j for i,j in zip(a,b)]

[2, 12, 30, 56, 90]

In [49]:
import requests
from bs4 import BeautifulSoup
res = requests.get('https://www.104.com.tw/job/?jobno=5mw95&jobsource=n104bank1')
soup = BeautifulSoup(res.text, 'html.parser') 
dd = [ele.text.strip() for ele in soup.select('dd')]
dt = [ele.text.strip() for ele in soup.select('dt')]
#for ele in zip(dt, dd):
#    print(ele)
dict(zip(dt, dd))

{'上班地點：': '台北市信義區松仁路123號8樓\n\n\n\n\n\n\n\n地圖找工作',
 '上班時段：': '日班',
 '休假制度：': '依公司規定',
 '其他條件：': 'Qualifications\r1. 5-8 years experience in software product marketing across multiple markets in Asia-Pacific \r2. Excellent verbal and written communication skills \r3. Strong track record of cross-functional collaboration\r4. Ability to work independently and proactively, strong project management skills.\r5. You should feel comfortable with ambiguity and enjoy working at a fast-paced startup where the business is continually evolving',
 '其他：': 'Please submit your CV via Appier career website,\rhttps://www.appier.com/en/careers.html\rWe look forward to hearing from you!',
 '出差外派：': '無需出差外派',
 '可上班日：': '不限',
 '學歷要求：': '大學以上',
 '工作待遇：': '面議',
 '工作性質：': '全職',
 '工作技能：': '不拘',
 '工作經歷：': '5年以上',
 '廠商求才專線': '忘記密碼',
 '接受身份：': '上班族、外籍人士、原住民【相關法令】',
 '擅長工具：': '不拘',
 '求職服務專線': '02-2912-6104\xa0轉2',
 '科系要求：': '不拘',
 '管理責任：': '不需負擔管理責任',
 '聯絡人：': '陳小姐',
 '職務類別：': '行銷企劃主管、產品企劃主管 \n\n\n\n\n\n\n認識「」職務\n\n詳細職類分析(工作內容、薪資分布..)\n更多相關工作',
 '語文條件：': '英文 -- 聽 /精通、說 /精通、讀 /精通、寫 /精通',
 '需求人數：': '1 人'}

In [53]:
import numpy 
a = [1,3,5,7,9]
b = [2,4,6,8,10]
na = numpy.array(a)
nb = numpy.array(b)
na * nb
na + nb

array([ 3,  7, 11, 15, 19])

In [55]:
import numpy as np
na = np.array([1,2,3,4,5])
na
type(na)

numpy.ndarray

In [57]:
na[0]

1

In [58]:
na[1:3]

array([2, 3])

In [60]:
na > 3

array([False, False, False,  True,  True], dtype=bool)

In [61]:
na[na > 3]

array([4, 5])

In [62]:
na=np.array([[1,2,3,4,5],[6,7,8,9,10]])

In [63]:
na

array([[ 1,  2,  3,  4,  5],
       [ 6,  7,  8,  9, 10]])

In [65]:
na[:,0]

array([1, 6])

In [66]:
na[0,:]

array([1, 2, 3, 4, 5])

In [67]:
na.T

array([[ 1,  6],
       [ 2,  7],
       [ 3,  8],
       [ 4,  9],
       [ 5, 10]])

In [68]:
na=np.array([['frank','M',29],['mary','F',23],['tom','M',35],['ted','M',33],['jean','F',21],['lisa','F',20]])
na

array([['frank', 'M', '29'],
       ['mary', 'F', '23'],
       ['tom', 'M', '35'],
       ['ted', 'M', '33'],
       ['jean', 'F', '21'],
       ['lisa', 'F', '20']],
      dtype='<U5')

In [69]:
import pandas
df = pandas.DataFrame([['frank','M',29],['mary','F',23],['tom','M',35],['ted','M',33],['jean','F',21],['lisa','F',20]])

In [71]:
df.columns

RangeIndex(start=0, stop=3, step=1)

In [72]:
df.columns = ['name', 'gender', 'age']

In [74]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
name      6 non-null object
gender    6 non-null object
age       6 non-null int64
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [75]:
df.loc[1:3,['name', 'gender']]

   name gender
1  mary      F
2   tom      M
3   ted      M

## Pandas Series

In [94]:
import pandas as pd
s = pd.Series([21000,18900, 18000])
s

0    21000
1    18900
2    18000
dtype: int64

In [95]:
type(s)

pandas.core.series.Series

In [96]:
pd.Series([21000,18900,18000], index=['Iphone','Edge S7','HTC M1'])

Iphone     21000
Edge S7    18900
HTC M1     18000
dtype: int64

In [97]:
s= pd.Series({'Iphone':21000,'Edge S7':18900,'HTC M1':18000})

In [98]:
s

Edge S7    18900
HTC M1     18000
Iphone     21000
dtype: int64

In [108]:
s.index

Index(['Edge S7', 'HTC M1', 'Iphone'], dtype='object')

In [109]:
s[0]

18900

In [110]:
s.index[0]

'Edge S7'

In [111]:
s[2]

21000

In [112]:
s[1:3]

HTC M1    18000
Iphone    21000
dtype: int64

In [113]:
s['Iphone']

21000

In [114]:
s[['Iphone','Edge S7']]

Iphone     21000
Edge S7    18900
dtype: int64

In [119]:
s[np.array([True, False, True]) ]

Edge S7    18900
Iphone     21000
dtype: int64

In [120]:
s < 20000

Edge S7     True
HTC M1      True
Iphone     False
dtype: bool

In [116]:
s[s < 20000]

Edge S7    18900
HTC M1     18000
dtype: int64

In [121]:
cheap=s<20000

In [123]:
cheap

Edge S7     True
HTC M1      True
Iphone     False
dtype: bool

In [124]:
s[cheap]

Edge S7    18900
HTC M1     18000
dtype: int64

In [125]:
s['Iphone']

21000

In [126]:
s['Iphone'] = 20000

In [127]:
s

Edge S7    18900
HTC M1     18000
Iphone     20000
dtype: int64

In [130]:
s[s<20000] = s[s<20000] * 0.8

In [131]:
s

Edge S7    15120
HTC M1     14400
Iphone     20000
dtype: int64

In [132]:
'Iphone' in s

True

In [133]:
'mi' in s

False

In [135]:
s * 0.8

Edge S7    12096.0
HTC M1     11520.0
Iphone     16000.0
dtype: float64

In [136]:
import numpy as np
np.sqrt(s)

Edge S7    122.963409
HTC M1     120.000000
Iphone     141.421356
dtype: float64

In [138]:
s.max()

20000

In [139]:
s.min()

14400

In [140]:
s.mean()

16506.666666666668

In [141]:
s.describe()

count        3.000000
mean     16506.666667
std       3046.659373
min      14400.000000
25%      14760.000000
50%      15120.000000
75%      17560.000000
max      20000.000000
dtype: float64

In [149]:
s[['HTC M1', 'Iphone']]
s[['mi', 'HTC M1']]

s2 = s[['HTC M1', 'Iphone']]+s[['mi', 'HTC M1']]

In [150]:
s2

HTC M1    28800.0
Iphone        NaN
mi            NaN
dtype: float64

In [151]:
s2.isnull()

HTC M1    False
Iphone     True
mi         True
dtype: bool

In [152]:
s2.notnull()

HTC M1     True
Iphone    False
mi        False
dtype: bool

In [145]:
# python
None

#numpy
np.nan

nan

## Pandas DataFrame

In [153]:
df=pd.DataFrame([['frank','M',29],['mary','F',23],['tom','M',35],['ted','M',33],['jean','F',21],['lisa','F',20]])
df.columns=['name','gender','age']
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

In [154]:
df=pd.DataFrame([['frank','M',29],['mary','F',23],['tom','M',35],['ted','M',33],['jean','F',21],['lisa','F',20]],columns=['name','gender','age'])
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

In [156]:
df=pd.DataFrame([{'name':'frank','gender':'M','age':29},
                 {'name':'mary','gender':'F','age':23},
                 {'name':'tom','gender':'M','age':35},
                 {'name':'ted','gender':'M','age':33},
                 {'name':'jean','gender':'F','age':21},
                 {'name':'lisa','gender':'F','age':20}])
df

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean
5   20      F   lisa

In [157]:
df=pd.DataFrame([{'name':'frank','gender':'M','age':29},
                 {'name':'mary','gender':'F','age':23},
                 {'name':'tom','gender':'M','age':35, 'occupation':'RD'},
                 {'name':'ted','gender':'M','age':33},
                 {'name':'jean','gender':'F','age':21},
                 {'name':'lisa','gender':'F','age':20}])
df

   age gender   name occupation
0   29      M  frank        NaN
1   23      F   mary        NaN
2   35      M    tom         RD
3   33      M    ted        NaN
4   21      F   jean        NaN
5   20      F   lisa        NaN

In [158]:
df.head()

   age gender   name occupation
0   29      M  frank        NaN
1   23      F   mary        NaN
2   35      M    tom         RD
3   33      M    ted        NaN
4   21      F   jean        NaN

In [159]:
df.head(3)

   age gender   name occupation
0   29      M  frank        NaN
1   23      F   mary        NaN
2   35      M    tom         RD

In [160]:
df.tail()

   age gender  name occupation
1   23      F  mary        NaN
2   35      M   tom         RD
3   33      M   ted        NaN
4   21      F  jean        NaN
5   20      F  lisa        NaN

In [162]:
df.tail(3)

   age gender  name occupation
3   33      M   ted        NaN
4   21      F  jean        NaN
5   20      F  lisa        NaN

In [163]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
age           6 non-null int64
gender        6 non-null object
name          6 non-null object
occupation    1 non-null object
dtypes: int64(1), object(3)
memory usage: 272.0+ bytes

In [164]:
df.describe()

             age
count   6.000000
mean   26.833333
std     6.400521
min    20.000000
25%    21.500000
50%    26.000000
75%    32.000000
max    35.000000

In [165]:
df.dtypes

age            int64
gender        object
name          object
occupation    object
dtype: object

In [167]:
df.ix[1]

age             23
gender           F
name          mary
occupation     NaN
Name: 1, dtype: object

In [168]:
df.ix[1:4]

   age gender  name occupation
1   23      F  mary        NaN
2   35      M   tom         RD
3   33      M   ted        NaN
4   21      F  jean        NaN

In [169]:
df['name']

0    frank
1     mary
2      tom
3      ted
4     jean
5     lisa
Name: name, dtype: object

In [170]:
df[['name', 'age']]

    name  age
0  frank   29
1   mary   23
2    tom   35
3    ted   33
4   jean   21
5   lisa   20

In [171]:
df.ix[  1:2    ,    ['name' , 'age']    ]

   name  age
1  mary   23
2   tom   35

In [172]:
type(df)

pandas.core.frame.DataFrame

In [173]:
type(df['name'])

pandas.core.series.Series

In [175]:
df['gender'] == 'M'

0     True
1    False
2     True
3     True
4    False
5    False
Name: gender, dtype: bool

In [176]:
df[df['gender'] == 'M']

   age gender   name occupation
0   29      M  frank        NaN
2   35      M    tom         RD
3   33      M    ted        NaN

In [179]:
(df['gender'] == 'M') & (df['age'] > 30)
df[(df['gender'] == 'M') & (df['age'] > 30)]

   age gender name occupation
2   35      M  tom         RD
3   33      M  ted        NaN

In [180]:
df[(df['gender'] == 'M') | (df['age'] > 30)]

   age gender   name occupation
0   29      M  frank        NaN
2   35      M    tom         RD
3   33      M    ted        NaN

In [181]:
df['employee'] = True

In [182]:
df

   age gender   name occupation  employee
0   29      M  frank        NaN      True
1   23      F   mary        NaN      True
2   35      M    tom         RD      True
3   33      M    ted        NaN      True
4   21      F   jean        NaN      True
5   20      F   lisa        NaN      True

In [183]:
del df['employee']

In [184]:
df

   age gender   name occupation
0   29      M  frank        NaN
1   23      F   mary        NaN
2   35      M    tom         RD
3   33      M    ted        NaN
4   21      F   jean        NaN
5   20      F   lisa        NaN

In [194]:
df.drop('occupation',1, inplace=True)
df.drop(5, 0, inplace=True)

In [195]:
df

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean

In [196]:
df.loc[5]={'age':20,'gender':'F','name':'qoo'}

In [197]:
df

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean
5   20      F    qoo

In [198]:
df.append(pd.DataFrame([{'age':20,'gender':'F','name':'qoo'}]),ignore_index=True)

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean
5   20      F    qoo
6   20      F    qoo

In [200]:
df

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean
5   20      F    qoo

In [201]:
df.drop(5)

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean

In [206]:
#df
df['userid']=range(101,107)

In [208]:
df.set_index('userid',inplace=True)

In [209]:
df

        age gender   name
userid
101      29      M  frank
102      23      F   mary
103      35      M    tom
104      33      M    ted
105      21      F   jean
106      20      F    qoo

In [211]:
df.iloc[1]

age         23
gender       F
name      mary
Name: 102, dtype: object

In [212]:
df.iloc[[1,3,5]]

        age gender  name
userid
102      23      F  mary
104      33      M   ted
106      20      F   qoo

In [213]:
df.ix[[101,103,105]]

        age gender   name
userid
101      29      M  frank
103      35      M    tom
105      21      F   jean

In [214]:
df.loc[[101,103,105]]

        age gender   name
userid
101      29      M  frank
103      35      M    tom
105      21      F   jean